// const resultContainer = ...
/**
 * Функция сложения двух чисел
 */

/**
 * Функция принимает имя и возвращает строку 'Привет, {Имя}'
 */

/**
 * Функция принимает вид животного (кошка или собака) и возвращает его звук (лай или мяуканье)'
 */

/**
 * Функция принимает длину радиуса круга и возвращает его площадь'
 */

const getRadius = radius => radius**2 * Math.PI

resultContainer.innerHTML = getRadius(10);

/**
 * Функция принимает ширину и высоту прямоугольника, возвращает true если это квадрат и false если нет'
 */

const getParametrs =(width,height) => width === height

resultContainer.innerHTML = getParametrs(20, 20);
/**
 * Функция принимает ширину и высоту прямоугольника и возвращает его периметр если это не квадрат'
 */


/**
 * Функция принимает аргументы ключа и значения и возвращает объект с этими ключом, значением'
 */
const keyObj = function (name,) {
    let newkeyObj = {}
}
/**
 * Функция принимает строки в неограниченном колличестве и все их выводит одной строкой через разделитель " | "'
 */
const getString = (...arg) => {
    return `${arg}`
    console.log(arg);
    return `${arg}`
}
getString()
/**
 * Функция принимает Имя и возвращает HTML тег <span> с этим именем красного цвета'
 */

/**
 * Функция принимает Имя и возвращает HTML тег <span> с текстом 'Привет, {Имя}'  красного цвета'
 */

/**
 * Функция принимает css селектор, находит первый элемент и добавляет к нему клас анимации "pulse"'
 */

/**
 * Функция принимает css селектор, находит первый элемент и добавляет к нему обработчик события "click".
 * При клике выводится alert с внутренним текстом элемента'
 */

